---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures
source: html/52d55510-8dbf-a2ef-5bb1-c155fd590ff3.htm
---
# BuiltInFailures.LooseDimensionFailures Properties

Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.